from __future__ import print_function
try:
    from googlesearch import search
    from time import sleep
    from colorama import Fore
    from platform import system
    import os
    import time
    import random
    import socket
    from urllib import request
    import sys
    path=os.getcwd()
    path=os.path.join(path,'lib')
    sys.path.append(path)
    import colorama
    from colorama import Fore,Back,Style
    import os
    import sys
    import random
    from tqdm.auto import tqdm
    import time

except ImportError:
    print("Woi babi pip install google")
    sys.exit()



class colors:
    CRED2 = "\33[91m"
    CBLUE2 = "\33[94m"
    ENDC = "\033[0m"

def slowprint(s):
    for c in s + '\n':
        sys.stdout.write(c)
        sys.stdout.flush() # defeat buffering
        time.sleep(random.random() * 0.1)

os.system("cls")
def ddos():
    def yourmom():
        try:
            request.urlopen('https://google.com/',timeout=3)
        except KeyboardInterrupt:
            print(Fore.RED+Style.BRIGHT + "\033[1;1mStop by user..." + Fore.RESET)
            exit()
        except:
            print(Fore.RED+Style.BRIGHT+'\033[1;1mPlease check your internet again again!...'+Fore.RESET)
            exit()

    try:
        print(Fore.CYAN+Style.BRIGHT+"\033[1;1mChecking your internet .... "+Fore.RESET)
        for i in tqdm(range(30000)):
            print(end=Fore.BLUE+Style.BRIGHT+ '\033[1;1m' +'\r' )

        time.sleep(1)
        yourmom()
    except KeyboardInterrupt:
        print(Fore.RED +Style.BRIGHT+ "ERROR" + Fore.RESET)
        exit()

ddos()
os.system("cls")
os.system("title BOTNET 💻 ")        
i = random.choice((f"""
{Fore.RED}
██████╗ ██████╗  ██████╗ ███████╗
██╔══██╗██╔══██╗██╔═══██╗██╔════╝
██║  ██║██║  ██║██║   ██║███████╗
██║  ██║██║  ██║██║   ██║╚════██║
██████╔╝██████╔╝╚██████╔╝███████║
╚═════╝ ╚═════╝  ╚═════╝ ╚══════╝


""", f"""

{Fore.MAGENTA}
_░▒███████ 
░██▓▒░░▒▓██         
██▓▒░__░▒▓██___██████
██▓▒░____░▓███▓__░▒▓██
██▓▒░___░▓██▓_____░▒▓██
██▓▒░_______________░▒▓██
_██▓▒░______________░▒▓██
__██▓▒░____________░▒▓██
___██▓▒░__________░▒▓██
____██▓▒░________░▒▓██
_____██▓▒░_____░▒▓██
______██▓▒░__░▒▓██
_______█▓▒░░▒▓██
_________░▒▓██
_______░▒▓██
_____░▒▓██





""",f"""
{Fore.LIGHTBLACK_EX}
▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒
▒▒█▒▒▒▄██████████▄▒▒▒▒
▒█▐▒▒▒████████████▒▒▒▒
▒▌▐▒▒██▄▀██████▀▄██▒▒▒
▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒
▐┼▐▒▒██████████████▒▒▒
▐▄▐████─▀▐▐▀█─█─▌▐██▄▒
▒▒█████──────────▐███▌
▒▒█▀▀██▄█─▄───▐─▄███▀▒
▒▒█▒▒███████▄██████▒▒▒
▒▒▒▒▒██████████████▒▒▒
▒▒▒▒▒█████████▐▌██▌▒▒▒
▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒
▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒


""",f"""
{Fore.YELLOW}
…………………▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄
……………▄▄█▓▓▓▒▒▒▒▒▒▒▒▒▒▓▓▓▓█▄▄
…………▄▀▀▓▒░░░░░░░░░░░░░░░░▒▓▓▀▄
………▄▀▓▒▒░░░░░░░░░░░░░░░░░░░▒▒▓▀▄
……..█▓█▒░░░░░░░░░░░░░░░░░░░░░▒▓▒▓█
…..▌▓▀▒░░░░░░░░░░░░░░░░░░░░░░░░▒▀▓█
…..█▌▓▒▒░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█
…▐█▓▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█▌
…█▓▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓█
..█▐▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒█▓█
…█▓█▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒█▌▓█
..█▓▓█▒░░░░▒█▄▒▒░░░░░░░░░▒▒▄█▒░░░░▒█▓▓█
..█▓█▒░▒▒▒▒░░▀▀█▄▄░░░░░▄▄█▀▀░░▒▒▒▒░▒█▓█
.█▓▌▒▒▓▓▓▓▄▄▄▒▒▒▀█░░░░█▀▒▒▒▄▄▄▓▓▓▓▒▒▐▓█
.██▌▒▓███▓█████▓▒▐▌░░▐▌▒▓████▓████▓▒▐██
..██▒▒▓███▓▓▓████▓▄░░░▄▓████▓▓▓███▓▒▒██
..█▓▒▒▓██████████▓▒░░░▒▓██████████▓▒▒▓█
..█▓▒░▒▓███████▓▓▄▀░░▀▄▓▓███████▓▒░▒▓█
….█▓▒░▒▒▓▓▓▓▄▄▄▀▒░░░░░▒▀▄▄▄▓▓▓▓▒▒░▓█
……█▓▒░▒▒▒▒░░░░░░▒▒▒▒░░░░░░▒▒▒▒░▒▓█
………█▓▓▒▒▒░░██░░▒▓██▓▒░░██░░▒▒▒▓▓█
………▀██▓▓▓▒░░▀░▒▓████▓▒░▀░░▒▓▓▓██▀
………….░▀█▓▒▒░░░▓█▓▒▒▓█▓▒░░▒▒▓█▀░
…………█░░██▓▓▒░░▒▒▒░▒▒▒░░▒▓▓██░░█
………….█▄░░▀█▓▒░░░░░░░░░░▒▓█▀░░▄█
…………..█▓█░░█▓▒▒▒░░░░░▒▒▒▓█░░█▓█
…………….█▓█░░█▀█▓▓▓▓▓▓█▀░░█░█▓█▌
……………..█▓▓█░█░█░█▀▀▀█░█░▄▀░█▓█
……………..█▓▓█░░▀█▀█░█░█▄█▀░░█▓▓█
………………█▓▒▓█░░░░▀▀▀▀░░░░░█▓▓█
………………█▓▒▒▓█░░░░ ░░░░░░░█▓▓█
………………..█▓▒▓██▄█░░░▄░░▄██▓▒▓█
………………..█▓▒▒▓█▒█▀█▄█▀█▒█▓▒▓█
………………..█▓▓▒▒▓██▒▒██▒██▓▒▒▓█
………………….█▓▓▒▒▓▀▀███▀▀▒▒▓▓█
……………………▀█▓▓▓▓▒▒▒▒▓▓▓▓█▀
………………………..▀▀██▓▓▓▓██▀



"""))

print(i + f'''
''')

slowprint(f"{Fore.YELLOW} DORK FINDER :o")
def dorks():
    try:
        col1 = input("\nDorks > ")
        coli = input("Total Website >  ")
        print ("\n ")

        requ = 0
        counter = 0
        swag = 0
        cameramen = 0

        for results in search(col1, tld="com", lang="en", num=int(coli), start=0, stop=None, pause=2):
            counter = counter + 1
            swag = swag + 100
            print (f"{Fore.WHITE}[ {Fore.GREEN}- {Fore.WHITE}] {Fore.LIGHTBLACK_EX}->{Fore.LIGHTCYAN_EX}", counter ,results, swag)
            time.sleep(0.1)
            requ += 1
            if requ >= int(coli):
                break
    except KeyboardInterrupt:
            os.system("clear")
            print ("\n")
            print ("\033[1;91m CTRL + C DETECTED!!\033[0")
            time.sleep(0.1)
            sys.exit(1)

    print ("\n\033[1;94m[•] Done... Exiting...")
    sys.exit()


# =====# Main #===== #
if __name__ == "__main__":
    dorks()
